Revit 2027 API
Rebar.MaxSpacing Property
 Identifies the maximum spacing between rebar in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaxSpacing { get; set; }
Public Property MaxSpacing As Double
	Get
	Set
public:
property double MaxSpacing {
	double get ();
	void set (double value);
}
member MaxSpacing : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The maxSpacing isn't bigger than 0.0.
InapplicableDataException |  MaxSpacing can't be obtained for a set whose layout rule is Single or CustomSpacing. -or- When setting this property: This rebar element represents a single bar (the layout rule is Single). -or- When setting this property: The rebar set layout does not permit changing the maximum spacing.
Remarks
The maximum spacing can be set for rebar sets with layout rule MaximumSpacing, MinimumClearSpacing or NumberWithSpacing.
For a set with layout rule CustomSpacing the spacings can be set through the formula. Use GetSpacingsBetweenBars() to get them.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace